app/Models/ModelPemenang.php

    public function daftarPemenang()
    {
        $mm = $this->db->table('pemenang as p');
        $mm->select('p.hadiah, p.anggota, p.keterangan, h.nama as namaHadiah, h.nominal, h.level, a.nama as namaAnggota, a.alamat, a.kelompok');
        $mm->join('hadiah as h', 'h.kode = p.hadiah');
        $mm->join('peserta as a', 'a.nia = p.anggota');
        $mm->orderBy('h.nominal', 'ASC');
        $data = $mm->get();
---
SELECT `p`.`hadiah`, `p`.`anggota`, `p`.`keterangan`, `h`.`nama` as `namaHadiah`, `h`.`nominal`, `h`.`level`, `a`.`nama` as `namaAnggota`, `a`.`alamat`, `a`.`kelompok`
FROM `pemenang` as `p`
JOIN `hadiah` as `h` ON `h`.`kode` = `p`.`hadiah`
JOIN `peserta` as `a` ON `a`.`nia` = `p`.`anggota`
ORDER BY `h`.`nominal` ASC