app/Models/ModelHadiah.php

    public function daftarHadiah()
    {
        $mm = $this->db->table('hadiah');
        $mm->select('*');
        $mm->where('qty != qty_pemenang');
        $mm->orderBy('level', 'ASC');
        $data = $mm->get();
---
SELECT *
FROM `hadiah`
WHERE `qty` != qty_pemenang
ORDER BY `level` ASC