app/Models/ModelPeserta.php

SELECT `p`.`nia`, `p`.`nama`, `p`.`alamat`, `p`.`kelompok`, `k`.`keterangan` as `namaKelompok`
FROM `peserta` as `p`
JOIN `kelompok` as `k` ON `k`.`kode` = `p`.`kelompok`
ORDER BY `k`.`keterangan` ASC
---
    public function listPeserta()
    {
        $mm = $this->db->table('peserta as p');
        $mm->select('p.nia, p.nama , p.alamat, p.kelompok, k.keterangan as namaKelompok');
        $mm->join('kelompok as k', 'k.kode = p.kelompok');
        $mm->orderBy('k.keterangan', 'ASC');
        $data = $mm->get();